PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_srss_v1_1.h
/* CLK_ECO.CONFIG */
#define CLK_ECO_CONFIG_ECO_DIV_DISABLE_Pos      27UL
#define CLK_ECO_CONFIG_ECO_DIV_DISABLE_Msk      0x8000000UL
#define CLK_ECO_CONFIG_ECO_DIV_ENABLE_Pos       28UL
#define CLK_ECO_CONFIG_ECO_DIV_ENABLE_Msk       0x10000000UL
#define CLK_ECO_CONFIG_ECO_EN_Pos               31UL
#define CLK_ECO_CONFIG_ECO_EN_Msk               0x80000000UL
/* CLK_ECO.CONFIG2 */
#define CLK_ECO_CONFIG2_ECO_TRIM_CL_Pos         0UL
#define CLK_ECO_CONFIG2_ECO_TRIM_CL_Msk         0x1FUL
#define CLK_ECO_CONFIG2_ECO_TRIM_GAIN_Pos       8UL
#define CLK_ECO_CONFIG2_ECO_TRIM_GAIN_Msk       0xF00UL
#define CLK_ECO_CONFIG2_ECO_CTRL_AMPDETEN_Pos   16UL
#define CLK_ECO_CONFIG2_ECO_CTRL_AMPDETEN_Msk   0x10000UL
/* CLK_ECO.STATUS */
#define CLK_ECO_STATUS_ECO_OK_Pos               0UL
#define CLK_ECO_STATUS_ECO_OK_Msk               0x1UL
#define CLK_ECO_STATUS_ECO_READY_Pos            1UL
#define CLK_ECO_STATUS_ECO_READY_Msk            0x2UL


/* CSV_HF_CSV.REF_CTL */
#define CSV_HF_CSV_REF_CTL_CSV_STARTUP_Pos      0UL
#define CSV_HF_CSV_REF_CTL_CSV_STARTUP_Msk      0xFFFFUL
#define CSV_HF_CSV_REF_CTL_CSV_ACTION_Pos       30UL
#define CSV_HF_CSV_REF_CTL_CSV_ACTION_Msk       0x40000000UL
#define CSV_HF_CSV_REF_CTL_CSV_EN_Pos           31UL
#define CSV_HF_CSV_REF_CTL_CSV_EN_Msk           0x80000000UL
/* CSV_HF_CSV.REF_LIMIT */
#define CSV_HF_CSV_REF_LIMIT_CSV_LOWER_Pos      0UL
#define CSV_HF_CSV_REF_LIMIT_CSV_LOWER_Msk      0xFFFFUL
#define CSV_HF_CSV_REF_LIMIT_CSV_UPPER_Pos      16UL
#define CSV_HF_CSV_REF_LIMIT_CSV_UPPER_Msk      0xFFFF0000UL
/* CSV_HF_CSV.MON_CTL */
#define CSV_HF_CSV_MON_CTL_CSV_PERIOD_Pos       0UL
#define CSV_HF_CSV_MON_CTL_CSV_PERIOD_Msk       0xFFFFUL


/* CSV_REF_CSV.REF_CTL */
#define CSV_REF_CSV_REF_CTL_CSV_STARTUP_Pos     0UL
#define CSV_REF_CSV_REF_CTL_CSV_STARTUP_Msk     0xFFFFUL
#define CSV_REF_CSV_REF_CTL_CSV_ACTION_Pos      30UL
#define CSV_REF_CSV_REF_CTL_CSV_ACTION_Msk      0x40000000UL
#define CSV_REF_CSV_REF_CTL_CSV_EN_Pos          31UL
#define CSV_REF_CSV_REF_CTL_CSV_EN_Msk          0x80000000UL
/* CSV_REF_CSV.REF_LIMIT */
#define CSV_REF_CSV_REF_LIMIT_CSV_LOWER_Pos     0UL
#define CSV_REF_CSV_REF_LIMIT_CSV_LOWER_Msk     0xFFFFUL
#define CSV_REF_CSV_REF_LIMIT_CSV_UPPER_Pos     16UL
#define CSV_REF_CSV_REF_LIMIT_CSV_UPPER_Msk     0xFFFF0000UL
/* CSV_REF_CSV.MON_CTL */
#define CSV_REF_CSV_MON_CTL_CSV_PERIOD_Pos      0UL
#define CSV_REF_CSV_MON_CTL_CSV_PERIOD_Msk      0xFFFFUL


/* CSV_LF_CSV.REF_CTL */
#define CSV_LF_CSV_REF_CTL_CSV_STARTUP_Pos      0UL
#define CSV_LF_CSV_REF_CTL_CSV_STARTUP_Msk      0xFFUL
#define CSV_LF_CSV_REF_CTL_CSV_EN_Pos           31UL
#define CSV_LF_CSV_REF_CTL_CSV_EN_Msk           0x80000000UL
/* CSV_LF_CSV.REF_LIMIT */
#define CSV_LF_CSV_REF_LIMIT_CSV_LOWER_Pos      0UL
#define CSV_LF_CSV_REF_LIMIT_CSV_LOWER_Msk      0xFFUL
#define CSV_LF_CSV_REF_LIMIT_CSV_UPPER_Pos      16UL
#define CSV_LF_CSV_REF_LIMIT_CSV_UPPER_Msk      0xFF0000UL
/* CSV_LF_CSV.MON_CTL */
#define CSV_LF_CSV_MON_CTL_CSV_PERIOD_Pos       0UL
#define CSV_LF_CSV_MON_CTL_CSV_PERIOD_Msk       0xFFUL


/* CSV_PILO_CSV.REF_CTL */
#define CSV_PILO_CSV_REF_CTL_CSV_STARTUP_Pos    0UL
#define CSV_PILO_CSV_REF_CTL_CSV_STARTUP_Msk    0xFFUL
#define CSV_PILO_CSV_REF_CTL_CSV_EN_Pos         31UL
#define CSV_PILO_CSV_REF_CTL_CSV_EN_Msk         0x80000000UL
/* CSV_PILO_CSV.REF_LIMIT */
#define CSV_PILO_CSV_REF_LIMIT_CSV_LOWER_Pos    0UL
#define CSV_PILO_CSV_REF_LIMIT_CSV_LOWER_Msk    0xFFUL
#define CSV_PILO_CSV_REF_LIMIT_CSV_UPPER_Pos    16UL
#define CSV_PILO_CSV_REF_LIMIT_CSV_UPPER_Msk    0xFF0000UL
/* CSV_PILO_CSV.MON_CTL */
#define CSV_PILO_CSV_MON_CTL_CSV_PERIOD_Pos     0UL
#define CSV_PILO_CSV_MON_CTL_CSV_PERIOD_Msk     0xFFUL


/* CLK_DPLL_LP.CONFIG */
#define CLK_DPLL_LP_CONFIG_FEEDBACK_DIV_Pos     0UL
#define CLK_DPLL_LP_CONFIG_FEEDBACK_DIV_Msk     0xFFUL
#define CLK_DPLL_LP_CONFIG_REFERENCE_DIV_Pos    8UL
#define CLK_DPLL_LP_CONFIG_REFERENCE_DIV_Msk    0x1F00UL
#define CLK_DPLL_LP_CONFIG_OUTPUT_DIV_Pos       16UL
#define CLK_DPLL_LP_CONFIG_OUTPUT_DIV_Msk       0x1F0000UL
#define CLK_DPLL_LP_CONFIG_PLL_DCO_MODE_Pos     27UL
#define CLK_DPLL_LP_CONFIG_PLL_DCO_MODE_Msk     0x8000000UL
#define CLK_DPLL_LP_CONFIG_BYPASS_SEL_Pos       28UL
#define CLK_DPLL_LP_CONFIG_BYPASS_SEL_Msk       0x30000000UL
#define CLK_DPLL_LP_CONFIG_ENABLE_Pos           31UL
#define CLK_DPLL_LP_CONFIG_ENABLE_Msk           0x80000000UL
/* CLK_DPLL_LP.CONFIG2 */
#define CLK_DPLL_LP_CONFIG2_FRAC_DIV_Pos        0UL
#define CLK_DPLL_LP_CONFIG2_FRAC_DIV_Msk        0xFFFFFFUL
#define CLK_DPLL_LP_CONFIG2_FRAC_DITHER_EN_Pos  28UL
#define CLK_DPLL_LP_CONFIG2_FRAC_DITHER_EN_Msk  0x70000000UL
#define CLK_DPLL_LP_CONFIG2_FRAC_EN_Pos         31UL
#define CLK_DPLL_LP_CONFIG2_FRAC_EN_Msk         0x80000000UL
/* CLK_DPLL_LP.CONFIG3 */
#define CLK_DPLL_LP_CONFIG3_SSCG_DEPTH_Pos      0UL
#define CLK_DPLL_LP_CONFIG3_SSCG_DEPTH_Msk      0x3FFUL
#define CLK_DPLL_LP_CONFIG3_SSCG_RATE_Pos       16UL
#define CLK_DPLL_LP_CONFIG3_SSCG_RATE_Msk       0x70000UL
#define CLK_DPLL_LP_CONFIG3_SSCG_DITHER_EN_Pos  24UL
#define CLK_DPLL_LP_CONFIG3_SSCG_DITHER_EN_Msk  0x1000000UL
#define CLK_DPLL_LP_CONFIG3_SSCG_MODE_Pos       28UL
#define CLK_DPLL_LP_CONFIG3_SSCG_MODE_Msk       0x10000000UL
#define CLK_DPLL_LP_CONFIG3_SSCG_EN_Pos         31UL
#define CLK_DPLL_LP_CONFIG3_SSCG_EN_Msk         0x80000000UL
/* CLK_DPLL_LP.CONFIG4 */
#define CLK_DPLL_LP_CONFIG4_DCO_CODE_Pos        0UL
#define CLK_DPLL_LP_CONFIG4_DCO_CODE_Msk        0x7FFUL
#define CLK_DPLL_LP_CONFIG4_PLL_CS_PB2_DIS_Pos  13UL
#define CLK_DPLL_LP_CONFIG4_PLL_CS_PB2_DIS_Msk  0x2000UL
#define CLK_DPLL_LP_CONFIG4_PLL_TG_Pos          20UL
#define CLK_DPLL_LP_CONFIG4_PLL_TG_Msk          0x300000UL
#define CLK_DPLL_LP_CONFIG4_PLL_SP_Pos          24UL
#define CLK_DPLL_LP_CONFIG4_PLL_SP_Msk          0x1000000UL
/* CLK_DPLL_LP.CONFIG5 */
#define CLK_DPLL_LP_CONFIG5_KI_INT_Pos          0UL
#define CLK_DPLL_LP_CONFIG5_KI_INT_Msk          0x3FUL
#define CLK_DPLL_LP_CONFIG5_KP_INT_Pos          7UL
#define CLK_DPLL_LP_CONFIG5_KP_INT_Msk          0x1F80UL
#define CLK_DPLL_LP_CONFIG5_KI_ACC_INT_Pos      14UL
#define CLK_DPLL_LP_CONFIG5_KI_ACC_INT_Msk      0xFC000UL
#define CLK_DPLL_LP_CONFIG5_KP_ACC_INT_Pos      21UL
#define CLK_DPLL_LP_CONFIG5_KP_ACC_INT_Msk      0x7E00000UL
#define CLK_DPLL_LP_CONFIG5_PWRUP_ACC_INT_Pos   28UL
#define CLK_DPLL_LP_CONFIG5_PWRUP_ACC_INT_Msk   0x70000000UL
/* CLK_DPLL_LP.CONFIG6 */
#define CLK_DPLL_LP_CONFIG6_KI_FRACT_Pos        0UL
#define CLK_DPLL_LP_CONFIG6_KI_FRACT_Msk        0x3FUL
#define CLK_DPLL_LP_CONFIG6_KP_FRACT_Pos        7UL
#define CLK_DPLL_LP_CONFIG6_KP_FRACT_Msk        0x1F80UL
#define CLK_DPLL_LP_CONFIG6_KI_ACC_FRACT_Pos    14UL
#define CLK_DPLL_LP_CONFIG6_KI_ACC_FRACT_Msk    0xFC000UL
#define CLK_DPLL_LP_CONFIG6_KP_ACC_FRACT_Pos    21UL
#define CLK_DPLL_LP_CONFIG6_KP_ACC_FRACT_Msk    0x7E00000UL
#define CLK_DPLL_LP_CONFIG6_PWRUP_ACC_FRACT_Pos 28UL
#define CLK_DPLL_LP_CONFIG6_PWRUP_ACC_FRACT_Msk 0x70000000UL
/* CLK_DPLL_LP.CONFIG7 */
#define CLK_DPLL_LP_CONFIG7_KI_SSCG_Pos         0UL
#define CLK_DPLL_LP_CONFIG7_KI_SSCG_Msk         0x3FUL
#define CLK_DPLL_LP_CONFIG7_KP_SSCG_Pos         7UL
#define CLK_DPLL_LP_CONFIG7_KP_SSCG_Msk         0x1F80UL
#define CLK_DPLL_LP_CONFIG7_KI_ACC_SSCG_Pos     14UL
#define CLK_DPLL_LP_CONFIG7_KI_ACC_SSCG_Msk     0xFC000UL
#define CLK_DPLL_LP_CONFIG7_KP_ACC_SSCG_Pos     21UL
#define CLK_DPLL_LP_CONFIG7_KP_ACC_SSCG_Msk     0x7E00000UL
#define CLK_DPLL_LP_CONFIG7_PWRUP_ACC_SSCG_Pos  28UL
#define CLK_DPLL_LP_CONFIG7_PWRUP_ACC_SSCG_Msk  0x70000000UL
/* CLK_DPLL_LP.STATUS */
#define CLK_DPLL_LP_STATUS_LOCKED_Pos           0UL
#define CLK_DPLL_LP_STATUS_LOCKED_Msk           0x1UL
#define CLK_DPLL_LP_STATUS_UNLOCK_OCCURRED_Pos  1UL
#define CLK_DPLL_LP_STATUS_UNLOCK_OCCURRED_Msk  0x2UL


