PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_srss_v1_1.h
/* CLK_DPLL_HP.CONFIG */
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_NDIV_INT_SEL_Pos 0UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_NDIV_INT_SEL_Msk 0xFFUL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_PDIV_SEL_Pos 8UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_PDIV_SEL_Msk 0x700UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_KDIV_SEL_Pos 12UL
#define CLK_DPLL_HP_CONFIG_PLL_FREQ_KDIV_SEL_Msk 0x7000UL
#define CLK_DPLL_HP_CONFIG_BYPASS_SEL_Pos       28UL
#define CLK_DPLL_HP_CONFIG_BYPASS_SEL_Msk       0x30000000UL
#define CLK_DPLL_HP_CONFIG_ENABLE_Pos           31UL
#define CLK_DPLL_HP_CONFIG_ENABLE_Msk           0x80000000UL
/* CLK_DPLL_HP.CONFIG2 */
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_NDIV_FRACT_SEL_Pos 0UL
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_NDIV_FRACT_SEL_Msk 0x1FFFFFUL
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_MODE_SEL_Pos 21UL
#define CLK_DPLL_HP_CONFIG2_PLL_FREQ_MODE_SEL_Msk 0xE00000UL
#define CLK_DPLL_HP_CONFIG2_PLL_IVR_TRIM_Pos    24UL
#define CLK_DPLL_HP_CONFIG2_PLL_IVR_TRIM_Msk    0xF000000UL
/* CLK_DPLL_HP.CONFIG3 */
#define CLK_DPLL_HP_CONFIG3_PLL_CLKR_SEL_Pos    0UL
#define CLK_DPLL_HP_CONFIG3_PLL_CLKR_SEL_Msk    0x1UL
#define CLK_DPLL_HP_CONFIG3_PLL_FDSM_SEL_Pos    29UL
#define CLK_DPLL_HP_CONFIG3_PLL_FDSM_SEL_Msk    0x20000000UL
/* CLK_DPLL_HP.CONFIG4 */
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_ALPHA_Pos 0UL
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_ALPHA_Msk 0x1FUL
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_BETA_Pos  5UL
#define CLK_DPLL_HP_CONFIG4_PLL_LF_LC_BETA_Msk  0x3E0UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_EN_THRESH_Pos 11UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_EN_THRESH_Msk 0x3800UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_WAITPER_Pos 16UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_WAITPER_Msk 0xF0000UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_THRESH_Pos 20UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_THRESH_Msk 0x700000UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_WAITPER_Pos 23UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_WAITPER_Msk 0x7800000UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_OBSWIN_Pos 27UL
#define CLK_DPLL_HP_CONFIG4_PLL_FLOCK_OBSWIN_Msk 0x78000000UL
/* CLK_DPLL_HP.CONFIG5 */
#define CLK_DPLL_HP_CONFIG5_PLL_LF_ALPHA_Pos    0UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_ALPHA_Msk    0x1FUL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_BETA_Pos     5UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_BETA_Msk     0x3E0UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_SET_PARAMS_Pos 12UL
#define CLK_DPLL_HP_CONFIG5_PLL_LF_SET_PARAMS_Msk 0x1000UL
#define CLK_DPLL_HP_CONFIG5_PLL_DT_CAL_DIG_Pos  16UL
#define CLK_DPLL_HP_CONFIG5_PLL_DT_CAL_DIG_Msk  0x1FFF0000UL
/* CLK_DPLL_HP.TRIGMOD */
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_FREQ_Pos 0UL
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_FREQ_Msk 0xFFFFUL
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_GRD_Pos  16UL
#define CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_GRD_Msk  0xFFFF0000UL
/* CLK_DPLL_HP.TRIGMOD2 */
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_RATE_Pos 0UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_RATE_Msk 0x7FFFFUL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_EN_Pos  20UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_EN_Msk  0x100000UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_STP_Pos 24UL
#define CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_STP_Msk 0x1000000UL
/* CLK_DPLL_HP.STATUS */
#define CLK_DPLL_HP_STATUS_LOCKED_Pos           0UL
#define CLK_DPLL_HP_STATUS_LOCKED_Msk           0x1UL
#define CLK_DPLL_HP_STATUS_UNLOCK_OCCURRED_Pos  1UL
#define CLK_DPLL_HP_STATUS_UNLOCK_OCCURRED_Msk  0x2UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_Pos  16UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_Msk  0x10000UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_ACK_Pos 20UL
#define CLK_DPLL_HP_STATUS_PLL_LOCKDET_RES_ACK_Msk 0x100000UL
/* CLK_DPLL_HP.DUTYCAL_CTRL */
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_DELTA_Pos 0UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_DELTA_Msk 0x7UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_RATIO_OK_Pos 3UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_RATIO_OK_Msk 0x8UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_OK_Pos 4UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTY_CAL_OK_Msk 0x10UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_TARGET_Pos 16UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_TARGET_Msk 0x1FFF0000UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_CTRL_RG_EN_Pos 29UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_CTRL_RG_EN_Msk 0x20000000UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_EN_Pos 31UL
#define CLK_DPLL_HP_DUTYCAL_CTRL_PLL_DUTYCAL_EN_Msk 0x80000000UL


/* CLK_TRIM_DPLL_LP.DPLL_LP_CTL */
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_CYCLE_STOP_COLD_Pos 0UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_CYCLE_STOP_COLD_Msk 0xFUL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_CYCLE_STOP_FAST_Pos 4UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_CYCLE_STOP_FAST_Msk 0xF0UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_DIS_COLD_Pos 8UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_DIS_COLD_Msk 0x100UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_DIS_FAST_Pos 9UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_SAR_DIS_FAST_Msk 0x200UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_PLL_SAR_FSM_EN_Pos 10UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_PLL_SAR_FSM_EN_Msk 0x400UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_LDO_DCO_TRIM_Pos 12UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_LDO_DCO_TRIM_Msk 0x7000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_PLL_DCO_SD_SEL_Pos 16UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_PLL_DCO_SD_SEL_Msk 0x30000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_LDO_PERI_TRIM_Pos 19UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_LDO_PERI_TRIM_Msk 0x380000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_PLL_FRAC_ORDER_Pos 22UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_PLL_FRAC_ORDER_Msk 0xC00000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_ISOLATE_N_Pos 24UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_ISOLATE_N_Msk 0x1000000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_ISOLATE_CNT_Pos 25UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_ISOLATE_CNT_Msk 0x7E000000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_ENABLE_CNT_Pos 31UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL_ENABLE_CNT_Msk 0x80000000UL
/* CLK_TRIM_DPLL_LP.DPLL_LP_CTL3 */
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL3_PHASE_ACC_CNT_Pos 0UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL3_PHASE_ACC_CNT_Msk 0x1FFUL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL3_PHASE_ACC_CNT_SSCG_Pos 16UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL3_PHASE_ACC_CNT_SSCG_Msk 0x1FF0000UL
/* CLK_TRIM_DPLL_LP.DPLL_LP_CTL4 */
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL4_LOCK_WAIT_FALL_Pos 0UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL4_LOCK_WAIT_FALL_Msk 0x3UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL4_LOCK_WAIT_RISE_COLD_Pos 4UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL4_LOCK_WAIT_RISE_COLD_Msk 0xFF0UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL4_LOCK_WAIT_RISE_FAST_Pos 20UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_CTL4_LOCK_WAIT_RISE_FAST_Msk 0xFF00000UL
/* CLK_TRIM_DPLL_LP.DPLL_LP_TEST4 */
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PLL_USER_DCO_CODE_Pos 0UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PLL_USER_DCO_CODE_Msk 0x7FFUL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PLL_DIS_FAST_LOCK_Pos 14UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PLL_DIS_FAST_LOCK_Msk 0x4000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PLL_READ_EN_Pos 15UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PLL_READ_EN_Msk 0x8000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PHASE_ACC_USER_WRITE_INT_Pos 16UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PHASE_ACC_USER_WRITE_INT_Msk 0x3F0000UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PHASE_ACC_USER_WRITE_FRACT_Pos 23UL
#define CLK_TRIM_DPLL_LP_DPLL_LP_TEST4_PHASE_ACC_USER_WRITE_FRACT_Msk 0x1F800000UL


