PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_srss_v1_1.h
/* MCWDT_CTR.CTL */
#define MCWDT_CTR_CTL_ENABLED_Pos               0UL
#define MCWDT_CTR_CTL_ENABLED_Msk               0x1UL
#define MCWDT_CTR_CTL_ENABLE_Pos                31UL
#define MCWDT_CTR_CTL_ENABLE_Msk                0x80000000UL
/* MCWDT_CTR.LOWER_LIMIT */
#define MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT_Pos   0UL
#define MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT_Msk   0xFFFFUL
/* MCWDT_CTR.UPPER_LIMIT */
#define MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT_Pos   0UL
#define MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT_Msk   0xFFFFUL
/* MCWDT_CTR.WARN_LIMIT */
#define MCWDT_CTR_WARN_LIMIT_WARN_LIMIT_Pos     0UL
#define MCWDT_CTR_WARN_LIMIT_WARN_LIMIT_Msk     0xFFFFUL
/* MCWDT_CTR.CONFIG */
#define MCWDT_CTR_CONFIG_LOWER_ACTION_Pos       0UL
#define MCWDT_CTR_CONFIG_LOWER_ACTION_Msk       0x3UL
#define MCWDT_CTR_CONFIG_UPPER_ACTION_Pos       4UL
#define MCWDT_CTR_CONFIG_UPPER_ACTION_Msk       0x30UL
#define MCWDT_CTR_CONFIG_WARN_ACTION_Pos        8UL
#define MCWDT_CTR_CONFIG_WARN_ACTION_Msk        0x100UL
#define MCWDT_CTR_CONFIG_AUTO_SERVICE_Pos       12UL
#define MCWDT_CTR_CONFIG_AUTO_SERVICE_Msk       0x1000UL
#define MCWDT_CTR_CONFIG_DEBUG_TRIGGER_EN_Pos   28UL
#define MCWDT_CTR_CONFIG_DEBUG_TRIGGER_EN_Msk   0x10000000UL
#define MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE_Pos    30UL
#define MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE_Msk    0x40000000UL
#define MCWDT_CTR_CONFIG_DEBUG_RUN_Pos          31UL
#define MCWDT_CTR_CONFIG_DEBUG_RUN_Msk          0x80000000UL
/* MCWDT_CTR.CNT */
#define MCWDT_CTR_CNT_CNT_Pos                   0UL
#define MCWDT_CTR_CNT_CNT_Msk                   0xFFFFUL


/* MCWDT.CPU_SELECT */
#define MCWDT_CPU_SELECT_CPU_SEL_Pos            0UL
#define MCWDT_CPU_SELECT_CPU_SEL_Msk            0x3UL
/* MCWDT.CTR2_CTL */
#define MCWDT_CTR2_CTL_ENABLED_Pos              0UL
#define MCWDT_CTR2_CTL_ENABLED_Msk              0x1UL
#define MCWDT_CTR2_CTL_ENABLE_Pos               31UL
#define MCWDT_CTR2_CTL_ENABLE_Msk               0x80000000UL
/* MCWDT.CTR2_CONFIG */
#define MCWDT_CTR2_CONFIG_ACTION_Pos            0UL
#define MCWDT_CTR2_CONFIG_ACTION_Msk            0x1UL
#define MCWDT_CTR2_CONFIG_BITS_Pos              16UL
#define MCWDT_CTR2_CONFIG_BITS_Msk              0x1F0000UL
#define MCWDT_CTR2_CONFIG_DEBUG_TRIGGER_EN_Pos  28UL
#define MCWDT_CTR2_CONFIG_DEBUG_TRIGGER_EN_Msk  0x10000000UL
#define MCWDT_CTR2_CONFIG_SLEEPDEEP_PAUSE_Pos   30UL
#define MCWDT_CTR2_CONFIG_SLEEPDEEP_PAUSE_Msk   0x40000000UL
#define MCWDT_CTR2_CONFIG_DEBUG_RUN_Pos         31UL
#define MCWDT_CTR2_CONFIG_DEBUG_RUN_Msk         0x80000000UL
/* MCWDT.CTR2_CNT */
#define MCWDT_CTR2_CNT_CNT2_Pos                 0UL
#define MCWDT_CTR2_CNT_CNT2_Msk                 0xFFFFFFFFUL
/* MCWDT.LOCK */
#define MCWDT_LOCK_MCWDT_LOCK_Pos               0UL
#define MCWDT_LOCK_MCWDT_LOCK_Msk               0x3UL
/* MCWDT.SERVICE */
#define MCWDT_SERVICE_CTR0_SERVICE_Pos          0UL
#define MCWDT_SERVICE_CTR0_SERVICE_Msk          0x1UL
#define MCWDT_SERVICE_CTR1_SERVICE_Pos          1UL
#define MCWDT_SERVICE_CTR1_SERVICE_Msk          0x2UL
/* MCWDT.INTR */
#define MCWDT_INTR_CTR0_INT_Pos                 0UL
#define MCWDT_INTR_CTR0_INT_Msk                 0x1UL
#define MCWDT_INTR_CTR1_INT_Pos                 1UL
#define MCWDT_INTR_CTR1_INT_Msk                 0x2UL
#define MCWDT_INTR_CTR2_INT_Pos                 2UL
#define MCWDT_INTR_CTR2_INT_Msk                 0x4UL
/* MCWDT.INTR_SET */
#define MCWDT_INTR_SET_CTR0_INT_Pos             0UL
#define MCWDT_INTR_SET_CTR0_INT_Msk             0x1UL
#define MCWDT_INTR_SET_CTR1_INT_Pos             1UL
#define MCWDT_INTR_SET_CTR1_INT_Msk             0x2UL
#define MCWDT_INTR_SET_CTR2_INT_Pos             2UL
#define MCWDT_INTR_SET_CTR2_INT_Msk             0x4UL
/* MCWDT.INTR_MASK */
#define MCWDT_INTR_MASK_CTR0_INT_Pos            0UL
#define MCWDT_INTR_MASK_CTR0_INT_Msk            0x1UL
#define MCWDT_INTR_MASK_CTR1_INT_Pos            1UL
#define MCWDT_INTR_MASK_CTR1_INT_Msk            0x2UL
#define MCWDT_INTR_MASK_CTR2_INT_Pos            2UL
#define MCWDT_INTR_MASK_CTR2_INT_Msk            0x4UL
/* MCWDT.INTR_MASKED */
#define MCWDT_INTR_MASKED_CTR0_INT_Pos          0UL
#define MCWDT_INTR_MASKED_CTR0_INT_Msk          0x1UL
#define MCWDT_INTR_MASKED_CTR1_INT_Pos          1UL
#define MCWDT_INTR_MASKED_CTR1_INT_Msk          0x2UL
#define MCWDT_INTR_MASKED_CTR2_INT_Pos          2UL
#define MCWDT_INTR_MASKED_CTR2_INT_Msk          0x4UL


/* SRSS.CLK_DSI_SELECT */
#define SRSS_CLK_DSI_SELECT_DSI_MUX_Pos         0UL
#define SRSS_CLK_DSI_SELECT_DSI_MUX_Msk         0x1FUL
/* SRSS.CLK_OUTPUT_FAST */
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL0_Pos      0UL
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL0_Msk      0xFUL
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL0_Pos      4UL
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL0_Msk      0xF0UL
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL0_Pos     8UL
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL0_Msk     0xF00UL
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL1_Pos      16UL
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL1_Msk      0xF0000UL
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL1_Pos      20UL
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL1_Msk      0xF00000UL
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL1_Pos     24UL
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL1_Msk     0xF000000UL
/* SRSS.CLK_OUTPUT_SLOW */
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL0_Pos      0UL
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL0_Msk      0xFUL
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL1_Pos      4UL
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL1_Msk      0xF0UL
/* SRSS.CLK_CAL_CNT1 */
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER1_Pos      0UL
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER1_Msk      0xFFFFFFUL
#define SRSS_CLK_CAL_CNT1_CAL_RESET_Pos         29UL
#define SRSS_CLK_CAL_CNT1_CAL_RESET_Msk         0x20000000UL
#define SRSS_CLK_CAL_CNT1_CAL_CLK1_PRESENT_Pos  30UL
#define SRSS_CLK_CAL_CNT1_CAL_CLK1_PRESENT_Msk  0x40000000UL
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER_DONE_Pos  31UL
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER_DONE_Msk  0x80000000UL
/* SRSS.CLK_CAL_CNT2 */
#define SRSS_CLK_CAL_CNT2_CAL_COUNTER2_Pos      0UL
#define SRSS_CLK_CAL_CNT2_CAL_COUNTER2_Msk      0xFFFFFFUL
/* SRSS.SRSS_INTR */
#define SRSS_SRSS_INTR_WDT_MATCH_Pos            0UL
#define SRSS_SRSS_INTR_WDT_MATCH_Msk            0x1UL
#define SRSS_SRSS_INTR_CLK_CAL_Pos              5UL
#define SRSS_SRSS_INTR_CLK_CAL_Msk              0x20UL
#define SRSS_SRSS_INTR_CSV_LF_Pos               8UL
#define SRSS_SRSS_INTR_CSV_LF_Msk               0x100UL
#define SRSS_SRSS_INTR_CSV_PILO_Pos             9UL
#define SRSS_SRSS_INTR_CSV_PILO_Msk             0x200UL
#define SRSS_SRSS_INTR_AINTR_Pos                31UL
#define SRSS_SRSS_INTR_AINTR_Msk                0x80000000UL
/* SRSS.SRSS_INTR_SET */
#define SRSS_SRSS_INTR_SET_WDT_MATCH_Pos        0UL
#define SRSS_SRSS_INTR_SET_WDT_MATCH_Msk        0x1UL
#define SRSS_SRSS_INTR_SET_CLK_CAL_Pos          5UL
#define SRSS_SRSS_INTR_SET_CLK_CAL_Msk          0x20UL
#define SRSS_SRSS_INTR_SET_CSV_LF_Pos           8UL
#define SRSS_SRSS_INTR_SET_CSV_LF_Msk           0x100UL
#define SRSS_SRSS_INTR_SET_CSV_PILO_Pos         9UL
#define SRSS_SRSS_INTR_SET_CSV_PILO_Msk         0x200UL
/* SRSS.SRSS_INTR_MASK */
#define SRSS_SRSS_INTR_MASK_WDT_MATCH_Pos       0UL
#define SRSS_SRSS_INTR_MASK_WDT_MATCH_Msk       0x1UL
#define SRSS_SRSS_INTR_MASK_CLK_CAL_Pos         5UL
#define SRSS_SRSS_INTR_MASK_CLK_CAL_Msk         0x20UL
#define SRSS_SRSS_INTR_MASK_CSV_LF_Pos          8UL
#define SRSS_SRSS_INTR_MASK_CSV_LF_Msk          0x100UL
#define SRSS_SRSS_INTR_MASK_CSV_PILO_Pos        9UL
#define SRSS_SRSS_INTR_MASK_CSV_PILO_Msk        0x200UL
/* SRSS.SRSS_INTR_MASKED */
#define SRSS_SRSS_INTR_MASKED_WDT_MATCH_Pos     0UL
#define SRSS_SRSS_INTR_MASKED_WDT_MATCH_Msk     0x1UL
#define SRSS_SRSS_INTR_MASKED_CLK_CAL_Pos       5UL
#define SRSS_SRSS_INTR_MASKED_CLK_CAL_Msk       0x20UL
#define SRSS_SRSS_INTR_MASKED_CSV_LF_Pos        8UL
#define SRSS_SRSS_INTR_MASKED_CSV_LF_Msk        0x100UL
#define SRSS_SRSS_INTR_MASKED_CSV_PILO_Pos      9UL
#define SRSS_SRSS_INTR_MASKED_CSV_PILO_Msk      0x200UL
#define SRSS_SRSS_INTR_MASKED_AINTR_Pos         31UL
#define SRSS_SRSS_INTR_MASKED_AINTR_Msk         0x80000000UL
/* SRSS.SRSS_AINTR */
#define SRSS_SRSS_AINTR_OVDVCCD_Pos             0UL
#define SRSS_SRSS_AINTR_OVDVCCD_Msk             0x1UL
#define SRSS_SRSS_AINTR_HVLVD_Pos               1UL
#define SRSS_SRSS_AINTR_HVLVD_Msk               0x2UL
/* SRSS.SRSS_AINTR_SET */
#define SRSS_SRSS_AINTR_SET_OVDVCCD_Pos         0UL
#define SRSS_SRSS_AINTR_SET_OVDVCCD_Msk         0x1UL
#define SRSS_SRSS_AINTR_SET_HVLVD_Pos           1UL
#define SRSS_SRSS_AINTR_SET_HVLVD_Msk           0x2UL
/* SRSS.SRSS_AINTR_MASK */
#define SRSS_SRSS_AINTR_MASK_OVDVCCD_Pos        0UL
#define SRSS_SRSS_AINTR_MASK_OVDVCCD_Msk        0x1UL
#define SRSS_SRSS_AINTR_MASK_HVLVD_Pos          1UL
#define SRSS_SRSS_AINTR_MASK_HVLVD_Msk          0x2UL
/* SRSS.SRSS_AINTR_MASKED */
#define SRSS_SRSS_AINTR_MASKED_OVDVCCD_Pos      0UL
#define SRSS_SRSS_AINTR_MASKED_OVDVCCD_Msk      0x1UL
#define SRSS_SRSS_AINTR_MASKED_HVLVD_Pos        1UL
#define SRSS_SRSS_AINTR_MASKED_HVLVD_Msk        0x2UL
/* SRSS.PWR_LVD_STATUS */
#define SRSS_PWR_LVD_STATUS_HVLVD_OK_Pos        0UL
#define SRSS_PWR_LVD_STATUS_HVLVD_OK_Msk        0x1UL
/* SRSS.BOOT_DLM_CTL */
#define SRSS_BOOT_DLM_CTL_REQUEST_Pos           0UL
#define SRSS_BOOT_DLM_CTL_REQUEST_Msk           0xFUL
#define SRSS_BOOT_DLM_CTL_INPUT_AVAIL_Pos       29UL
#define SRSS_BOOT_DLM_CTL_INPUT_AVAIL_Msk       0x20000000UL
#define SRSS_BOOT_DLM_CTL_RESET_Pos             30UL
#define SRSS_BOOT_DLM_CTL_RESET_Msk             0x40000000UL
#define SRSS_BOOT_DLM_CTL_WFA_Pos               31UL
#define SRSS_BOOT_DLM_CTL_WFA_Msk               0x80000000UL
/* SRSS.BOOT_DLM_CTL2 */
#define SRSS_BOOT_DLM_CTL2_APP_CTL_Pos          0UL
#define SRSS_BOOT_DLM_CTL2_APP_CTL_Msk          0xFFFFFFFFUL
/* SRSS.BOOT_DLM_STATUS */
#define SRSS_BOOT_DLM_STATUS_DEBUG_STATUS_Pos   0UL
#define SRSS_BOOT_DLM_STATUS_DEBUG_STATUS_Msk   0xFFFFFFFFUL
/* SRSS.RES_SOFT_CTL */
#define SRSS_RES_SOFT_CTL_TRIGGER_SOFT_Pos      0UL
#define SRSS_RES_SOFT_CTL_TRIGGER_SOFT_Msk      0x1UL
/* SRSS.BOOT_STATUS */
#define SRSS_BOOT_STATUS_DEBUG_STATUS_Pos       0UL
#define SRSS_BOOT_STATUS_DEBUG_STATUS_Msk       0xFFFFFFFFUL
/* SRSS.BOOT_ENTRY */
#define SRSS_BOOT_ENTRY_WARM_BOOT_ENTRY_Pos     0UL
#define SRSS_BOOT_ENTRY_WARM_BOOT_ENTRY_Msk     0xFFFFFFFFUL
/* SRSS.DECODED_LCS_DATA */
#define SRSS_DECODED_LCS_DATA_K_CODE_Pos        0UL
#define SRSS_DECODED_LCS_DATA_K_CODE_Msk        0x3UL
#define SRSS_DECODED_LCS_DATA_P_CODE_Pos        2UL
#define SRSS_DECODED_LCS_DATA_P_CODE_Msk        0xCUL
#define SRSS_DECODED_LCS_DATA_S_CODE_Pos        4UL
#define SRSS_DECODED_LCS_DATA_S_CODE_Msk        0x30UL
#define SRSS_DECODED_LCS_DATA_N_CODE_Pos        6UL
#define SRSS_DECODED_LCS_DATA_N_CODE_Msk        0xC0UL
#define SRSS_DECODED_LCS_DATA_R_CODE_Pos        8UL
#define SRSS_DECODED_LCS_DATA_R_CODE_Msk        0x300UL
#define SRSS_DECODED_LCS_DATA_B_CODE_Pos        10UL
#define SRSS_DECODED_LCS_DATA_B_CODE_Msk        0xC00UL
/* SRSS.PWR_HIB_DATA */
#define SRSS_PWR_HIB_DATA_HIB_DATA_Pos          0UL
#define SRSS_PWR_HIB_DATA_HIB_DATA_Msk          0xFFFFFFFFUL
/* SRSS.PWR_HIB_WAKE_CTL */
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_SRC_Pos  0UL
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_SRC_Msk  0xFFFFFFUL
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_CSV_BAK_Pos 29UL
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_CSV_BAK_Msk 0x20000000UL
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_RTC_Pos  30UL
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_RTC_Msk  0x40000000UL
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_WDT_Pos  31UL
#define SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_WDT_Msk  0x80000000UL
/* SRSS.PWR_HIB_WAKE_CTL2 */
#define SRSS_PWR_HIB_WAKE_CTL2_HIB_WAKE_SRC_Pos 0UL
#define SRSS_PWR_HIB_WAKE_CTL2_HIB_WAKE_SRC_Msk 0xFFFFFFUL
/* SRSS.PWR_HIB_WAKE_CAUSE */
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_SRC_Pos 0UL
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_SRC_Msk 0xFFFFFFUL
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_CSV_BAK_Pos 29UL
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_CSV_BAK_Msk 0x20000000UL
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_RTC_Pos 30UL
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_RTC_Msk 0x40000000UL
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_WDT_Pos 31UL
#define SRSS_PWR_HIB_WAKE_CAUSE_HIB_WAKE_WDT_Msk 0x80000000UL
/* SRSS.TST_XRES_SECURE */
#define SRSS_TST_XRES_SECURE_DATA8_Pos          0UL
#define SRSS_TST_XRES_SECURE_DATA8_Msk          0xFFUL
#define SRSS_TST_XRES_SECURE_FW_WR_Pos          8UL
#define SRSS_TST_XRES_SECURE_FW_WR_Msk          0xF00UL
#define SRSS_TST_XRES_SECURE_SECURE_WR_Pos      16UL
#define SRSS_TST_XRES_SECURE_SECURE_WR_Msk      0xF0000UL
#define SRSS_TST_XRES_SECURE_FW_KEY_OK_Pos      29UL
#define SRSS_TST_XRES_SECURE_FW_KEY_OK_Msk      0x20000000UL
#define SRSS_TST_XRES_SECURE_SECURE_KEY_OK_Pos  30UL
#define SRSS_TST_XRES_SECURE_SECURE_KEY_OK_Msk  0x40000000UL
#define SRSS_TST_XRES_SECURE_SECURE_DISABLE_Pos 31UL
#define SRSS_TST_XRES_SECURE_SECURE_DISABLE_Msk 0x80000000UL
/* SRSS.PWR_CTL */
#define SRSS_PWR_CTL_DEBUG_SESSION_Pos          4UL
#define SRSS_PWR_CTL_DEBUG_SESSION_Msk          0x10UL
#define SRSS_PWR_CTL_LPM_READY_Pos              5UL
#define SRSS_PWR_CTL_LPM_READY_Msk              0x20UL
/* SRSS.PWR_CTL2 */
#define SRSS_PWR_CTL2_REFSYS_VREF_OK_Pos        17UL
#define SRSS_PWR_CTL2_REFSYS_VREF_OK_Msk        0x20000UL
#define SRSS_PWR_CTL2_REFSYS_VBUF_DIS_Pos       20UL
#define SRSS_PWR_CTL2_REFSYS_VBUF_DIS_Msk       0x100000UL
#define SRSS_PWR_CTL2_REFSYS_VREFBUF_OK_Pos     21UL
#define SRSS_PWR_CTL2_REFSYS_VREFBUF_OK_Msk     0x200000UL
#define SRSS_PWR_CTL2_REFSYS_IREF_OK_Pos        25UL
#define SRSS_PWR_CTL2_REFSYS_IREF_OK_Msk        0x2000000UL
#define SRSS_PWR_CTL2_PORBOD_LPMODE_Pos         27UL
#define SRSS_PWR_CTL2_PORBOD_LPMODE_Msk         0x8000000UL
#define SRSS_PWR_CTL2_BGREF_LPMODE_Pos          28UL
#define SRSS_PWR_CTL2_BGREF_LPMODE_Msk          0x10000000UL
#define SRSS_PWR_CTL2_FREEZE_DPSLP_Pos          30UL
#define SRSS_PWR_CTL2_FREEZE_DPSLP_Msk          0x40000000UL
#define SRSS_PWR_CTL2_FREEZE_DPSLP_PD1_Pos      31UL
#define SRSS_PWR_CTL2_FREEZE_DPSLP_PD1_Msk      0x80000000UL
/* SRSS.PWR_HIBERNATE */
#define SRSS_PWR_HIBERNATE_TOKEN_Pos            0UL
#define SRSS_PWR_HIBERNATE_TOKEN_Msk            0xFFUL
#define SRSS_PWR_HIBERNATE_UNLOCK_Pos           8UL
#define SRSS_PWR_HIBERNATE_UNLOCK_Msk           0xFF00UL
#define SRSS_PWR_HIBERNATE_FREEZE_Pos           17UL
#define SRSS_PWR_HIBERNATE_FREEZE_Msk           0x20000UL
#define SRSS_PWR_HIBERNATE_MASK_HIBALARM_Pos    18UL
#define SRSS_PWR_HIBERNATE_MASK_HIBALARM_Msk    0x40000UL
#define SRSS_PWR_HIBERNATE_MASK_HIBWDT_Pos      19UL
#define SRSS_PWR_HIBERNATE_MASK_HIBWDT_Msk      0x80000UL
#define SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Pos  20UL
#define SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Msk  0xF00000UL
#define SRSS_PWR_HIBERNATE_MASK_HIBPIN_Pos      24UL
#define SRSS_PWR_HIBERNATE_MASK_HIBPIN_Msk      0xF000000UL
#define SRSS_PWR_HIBERNATE_SENSE_MODE_Pos       29UL
#define SRSS_PWR_HIBERNATE_SENSE_MODE_Msk       0x20000000UL
#define SRSS_PWR_HIBERNATE_HIBERNATE_DISABLE_Pos 30UL
#define SRSS_PWR_HIBERNATE_HIBERNATE_DISABLE_Msk 0x40000000UL
#define SRSS_PWR_HIBERNATE_HIBERNATE_Pos        31UL
#define SRSS_PWR_HIBERNATE_HIBERNATE_Msk        0x80000000UL
/* SRSS.PWR_LVD_CTL */
#define SRSS_PWR_LVD_CTL_HVLVD_TRIPSEL_Pos      0UL
#define SRSS_PWR_LVD_CTL_HVLVD_TRIPSEL_Msk      0xFUL
#define SRSS_PWR_LVD_CTL_HVLVD_DPSLP_EN_Pos     6UL
#define SRSS_PWR_LVD_CTL_HVLVD_DPSLP_EN_Msk     0x40UL
#define SRSS_PWR_LVD_CTL_HVLVD_EN_Pos           7UL
#define SRSS_PWR_LVD_CTL_HVLVD_EN_Msk           0x80UL
#define SRSS_PWR_LVD_CTL_HVLVD_EDGE_SEL_Pos     16UL
#define SRSS_PWR_LVD_CTL_HVLVD_EDGE_SEL_Msk     0x30000UL
#define SRSS_PWR_LVD_CTL_HVLVD_ACTION_Pos       18UL
#define SRSS_PWR_LVD_CTL_HVLVD_ACTION_Msk       0x40000UL
/* SRSS.CLK_PATH_SELECT */
#define SRSS_CLK_PATH_SELECT_PATH_MUX_Pos       0UL
#define SRSS_CLK_PATH_SELECT_PATH_MUX_Msk       0x7UL
/* SRSS.CLK_ROOT_SELECT */
#define SRSS_CLK_ROOT_SELECT_ROOT_MUX_Pos       0UL
#define SRSS_CLK_ROOT_SELECT_ROOT_MUX_Msk       0xFUL
#define SRSS_CLK_ROOT_SELECT_ROOT_DIV_Pos       8UL
#define SRSS_CLK_ROOT_SELECT_ROOT_DIV_Msk       0xF00UL
#define SRSS_CLK_ROOT_SELECT_ENABLE_Pos         31UL
#define SRSS_CLK_ROOT_SELECT_ENABLE_Msk         0x80000000UL
/* SRSS.CLK_DIRECT_SELECT */
#define SRSS_CLK_DIRECT_SELECT_DIRECT_MUX_Pos   8UL
#define SRSS_CLK_DIRECT_SELECT_DIRECT_MUX_Msk   0x100UL
/* SRSS.CLK_SELECT */
#define SRSS_CLK_SELECT_LFCLK_SEL_Pos           0UL
#define SRSS_CLK_SELECT_LFCLK_SEL_Msk           0x7UL
/* SRSS.CLK_MF_SELECT */
#define SRSS_CLK_MF_SELECT_MFCLK_SEL_Pos        0UL
#define SRSS_CLK_MF_SELECT_MFCLK_SEL_Msk        0x7UL
#define SRSS_CLK_MF_SELECT_MFCLK_DIV_Pos        8UL
#define SRSS_CLK_MF_SELECT_MFCLK_DIV_Msk        0xFF00UL
#define SRSS_CLK_MF_SELECT_ENABLE_Pos           31UL
#define SRSS_CLK_MF_SELECT_ENABLE_Msk           0x80000000UL
/* SRSS.CLK_ALTHF_CTL */
#define SRSS_CLK_ALTHF_CTL_ALTHF_ENABLED_Pos    0UL
#define SRSS_CLK_ALTHF_CTL_ALTHF_ENABLED_Msk    0x1UL
#define SRSS_CLK_ALTHF_CTL_ALTHF_ENABLE_Pos     31UL
#define SRSS_CLK_ALTHF_CTL_ALTHF_ENABLE_Msk     0x80000000UL
/* SRSS.CLK_ECO_PRESCALE */
#define SRSS_CLK_ECO_PRESCALE_ECO_DIV_ENABLED_Pos 0UL
#define SRSS_CLK_ECO_PRESCALE_ECO_DIV_ENABLED_Msk 0x1UL
#define SRSS_CLK_ECO_PRESCALE_ECO_FRAC_DIV_Pos  8UL
#define SRSS_CLK_ECO_PRESCALE_ECO_FRAC_DIV_Msk  0xFF00UL
#define SRSS_CLK_ECO_PRESCALE_ECO_INT_DIV_Pos   16UL
#define SRSS_CLK_ECO_PRESCALE_ECO_INT_DIV_Msk   0x3FF0000UL
/* SRSS.CLK_IMO_CONFIG */
#define SRSS_CLK_IMO_CONFIG_DPSLP_ENABLE_Pos    30UL
#define SRSS_CLK_IMO_CONFIG_DPSLP_ENABLE_Msk    0x40000000UL
#define SRSS_CLK_IMO_CONFIG_ENABLE_Pos          31UL
#define SRSS_CLK_IMO_CONFIG_ENABLE_Msk          0x80000000UL
/* SRSS.CLK_IHO_CONFIG */
#define SRSS_CLK_IHO_CONFIG_IHO_TRIM_FREQ_Pos   0UL
#define SRSS_CLK_IHO_CONFIG_IHO_TRIM_FREQ_Msk   0x7FFUL
#define SRSS_CLK_IHO_CONFIG_DPSLP_ENABLE_Pos    30UL
#define SRSS_CLK_IHO_CONFIG_DPSLP_ENABLE_Msk    0x40000000UL
/* SRSS.CLK_PILO_CONFIG */
#define SRSS_CLK_PILO_CONFIG_PILO_EN_Pos        31UL
#define SRSS_CLK_PILO_CONFIG_PILO_EN_Msk        0x80000000UL
/* SRSS.CLK_PILO_STATUS */
#define SRSS_CLK_PILO_STATUS_PILO_OK_Pos        0UL
#define SRSS_CLK_PILO_STATUS_PILO_OK_Msk        0x1UL
/* SRSS.CLK_ILO_CONFIG */
#define SRSS_CLK_ILO_CONFIG_ENABLE_Pos          31UL
#define SRSS_CLK_ILO_CONFIG_ENABLE_Msk          0x80000000UL
/* SRSS.CLK_TRIM_ILO_CTL */
#define SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM_Pos     0UL
#define SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM_Msk     0x3FUL
/* SRSS.CLK_WCO_CONFIG */
#define SRSS_CLK_WCO_CONFIG_WCO_EN_Pos          3UL
#define SRSS_CLK_WCO_CONFIG_WCO_EN_Msk          0x8UL
#define SRSS_CLK_WCO_CONFIG_CLK_RTC_SEL_Pos     8UL
#define SRSS_CLK_WCO_CONFIG_CLK_RTC_SEL_Msk     0x700UL
#define SRSS_CLK_WCO_CONFIG_PRESCALER_Pos       12UL
#define SRSS_CLK_WCO_CONFIG_PRESCALER_Msk       0x3000UL
#define SRSS_CLK_WCO_CONFIG_WCO_BYPASS_Pos      16UL
#define SRSS_CLK_WCO_CONFIG_WCO_BYPASS_Msk      0x10000UL
#define SRSS_CLK_WCO_CONFIG_WCO_TRIM_GAIN_Pos   20UL
#define SRSS_CLK_WCO_CONFIG_WCO_TRIM_GAIN_Msk   0xF00000UL
#define SRSS_CLK_WCO_CONFIG_WCO_CTRL_PWRMOD_Pos 24UL
#define SRSS_CLK_WCO_CONFIG_WCO_CTRL_PWRMOD_Msk 0x3000000UL
/* SRSS.CLK_WCO_STATUS */
#define SRSS_CLK_WCO_STATUS_WCO_OK_Pos          2UL
#define SRSS_CLK_WCO_STATUS_WCO_OK_Msk          0x4UL
/* SRSS.CSV_REF_SEL */
#define SRSS_CSV_REF_SEL_REF_MUX_Pos            0UL
#define SRSS_CSV_REF_SEL_REF_MUX_Msk            0x7UL
/* SRSS.CSV_LF_REF_SEL */
#define SRSS_CSV_LF_REF_SEL_LF_REF_MUX_Pos      0UL
#define SRSS_CSV_LF_REF_SEL_LF_REF_MUX_Msk      0x3UL
/* SRSS.CSV_PILO_REF_SEL */
#define SRSS_CSV_PILO_REF_SEL_PILO_REF_MUX_Pos  0UL
#define SRSS_CSV_PILO_REF_SEL_PILO_REF_MUX_Msk  0x3UL
/* SRSS.RES_CAUSE */
#define SRSS_RES_CAUSE_RESET_WDT_Pos            0UL
#define SRSS_RES_CAUSE_RESET_WDT_Msk            0x1UL
#define SRSS_RES_CAUSE_RESET_ACT_FAULT_Pos      1UL
#define SRSS_RES_CAUSE_RESET_ACT_FAULT_Msk      0x2UL
#define SRSS_RES_CAUSE_RESET_DPSLP_FAULT_Pos    2UL
#define SRSS_RES_CAUSE_RESET_DPSLP_FAULT_Msk    0x4UL
#define SRSS_RES_CAUSE_RESET_TC_DBGRESET_Pos    3UL
#define SRSS_RES_CAUSE_RESET_TC_DBGRESET_Msk    0x8UL
#define SRSS_RES_CAUSE_RESET_SOFT_Pos           4UL
#define SRSS_RES_CAUSE_RESET_SOFT_Msk           0x10UL
#define SRSS_RES_CAUSE_RESET_SOFT1_Pos          5UL
#define SRSS_RES_CAUSE_RESET_SOFT1_Msk          0x20UL
#define SRSS_RES_CAUSE_RESET_SOFT2_Pos          6UL
#define SRSS_RES_CAUSE_RESET_SOFT2_Msk          0x40UL
#define SRSS_RES_CAUSE_RESET_MCWDT0_Pos         8UL
#define SRSS_RES_CAUSE_RESET_MCWDT0_Msk         0x100UL
#define SRSS_RES_CAUSE_RESET_MCWDT1_Pos         9UL
#define SRSS_RES_CAUSE_RESET_MCWDT1_Msk         0x200UL
#define SRSS_RES_CAUSE_RESET_MCWDT2_Pos         10UL
#define SRSS_RES_CAUSE_RESET_MCWDT2_Msk         0x400UL
#define SRSS_RES_CAUSE_RESET_MCWDT3_Pos         11UL
#define SRSS_RES_CAUSE_RESET_MCWDT3_Msk         0x800UL
/* SRSS.RES_CAUSE2 */
#define SRSS_RES_CAUSE2_RESET_CSV_HF_Pos        0UL
#define SRSS_RES_CAUSE2_RESET_CSV_HF_Msk        0xFFFFUL
#define SRSS_RES_CAUSE2_RESET_CSV_REF_Pos       16UL
#define SRSS_RES_CAUSE2_RESET_CSV_REF_Msk       0x10000UL
/* SRSS.RES_PXRES_CTL */
#define SRSS_RES_PXRES_CTL_PXRES_TRIGGER_Pos    0UL
#define SRSS_RES_PXRES_CTL_PXRES_TRIGGER_Msk    0x1UL
/* SRSS.RES_CAUSE_EXTEND */
#define SRSS_RES_CAUSE_EXTEND_RESET_XRES_Pos    16UL
#define SRSS_RES_CAUSE_EXTEND_RESET_XRES_Msk    0x10000UL
#define SRSS_RES_CAUSE_EXTEND_RESET_BODVDDD_Pos 17UL
#define SRSS_RES_CAUSE_EXTEND_RESET_BODVDDD_Msk 0x20000UL
#define SRSS_RES_CAUSE_EXTEND_RESET_BODVCCD_Pos 19UL
#define SRSS_RES_CAUSE_EXTEND_RESET_BODVCCD_Msk 0x80000UL
#define SRSS_RES_CAUSE_EXTEND_RESET_BODVBAT_Pos 20UL
#define SRSS_RES_CAUSE_EXTEND_RESET_BODVBAT_Msk 0x100000UL
#define SRSS_RES_CAUSE_EXTEND_RESET_OVDVCCD_Pos 22UL
#define SRSS_RES_CAUSE_EXTEND_RESET_OVDVCCD_Msk 0x400000UL
#define SRSS_RES_CAUSE_EXTEND_RESET_PXRES_Pos   28UL
#define SRSS_RES_CAUSE_EXTEND_RESET_PXRES_Msk   0x10000000UL
#define SRSS_RES_CAUSE_EXTEND_RESET_STRUCT_XRES_Pos 29UL
#define SRSS_RES_CAUSE_EXTEND_RESET_STRUCT_XRES_Msk 0x20000000UL
#define SRSS_RES_CAUSE_EXTEND_RESET_PORVDDD_Pos 30UL
#define SRSS_RES_CAUSE_EXTEND_RESET_PORVDDD_Msk 0x40000000UL
/* SRSS.PWR_CBUCK_CTL */
#define SRSS_PWR_CBUCK_CTL_CBUCK_VSEL_Pos       0UL
#define SRSS_PWR_CBUCK_CTL_CBUCK_VSEL_Msk       0x1FUL
#define SRSS_PWR_CBUCK_CTL_CBUCK_MODE_Pos       8UL
#define SRSS_PWR_CBUCK_CTL_CBUCK_MODE_Msk       0x1F00UL
/* SRSS.PWR_CBUCK_CTL2 */
#define SRSS_PWR_CBUCK_CTL2_CBUCK_PROFILE_Pos   0UL
#define SRSS_PWR_CBUCK_CTL2_CBUCK_PROFILE_Msk   0x3UL
#define SRSS_PWR_CBUCK_CTL2_RESERVED_CTL2_Pos   30UL
#define SRSS_PWR_CBUCK_CTL2_RESERVED_CTL2_Msk   0x40000000UL
#define SRSS_PWR_CBUCK_CTL2_RESERVED_CTL_Pos    31UL
#define SRSS_PWR_CBUCK_CTL2_RESERVED_CTL_Msk    0x80000000UL
/* SRSS.PWR_CBUCK_DPSLP_CTL */
#define SRSS_PWR_CBUCK_DPSLP_CTL_CBUCK_DPSLP_VSEL_Pos 0UL
#define SRSS_PWR_CBUCK_DPSLP_CTL_CBUCK_DPSLP_VSEL_Msk 0x1FUL
#define SRSS_PWR_CBUCK_DPSLP_CTL_CBUCK_DPSLP_MODE_Pos 8UL
#define SRSS_PWR_CBUCK_DPSLP_CTL_CBUCK_DPSLP_MODE_Msk 0x1F00UL
#define SRSS_PWR_CBUCK_DPSLP_CTL_CBUCK_DPSLP_OVERRIDE_Pos 31UL
#define SRSS_PWR_CBUCK_DPSLP_CTL_CBUCK_DPSLP_OVERRIDE_Msk 0x80000000UL
/* SRSS.PWR_CBUCK_STATUS */
#define SRSS_PWR_CBUCK_STATUS_SRAMLDO_DONE_Pos  0UL
#define SRSS_PWR_CBUCK_STATUS_SRAMLDO_DONE_Msk  0x1UL
#define SRSS_PWR_CBUCK_STATUS_SRAMLDO_SW_ON_Pos 1UL
#define SRSS_PWR_CBUCK_STATUS_SRAMLDO_SW_ON_Msk 0x2UL
#define SRSS_PWR_CBUCK_STATUS_RETLDO_DONE_Pos   8UL
#define SRSS_PWR_CBUCK_STATUS_RETLDO_DONE_Msk   0x100UL
#define SRSS_PWR_CBUCK_STATUS_MISCLDO_DONE_Pos  15UL
#define SRSS_PWR_CBUCK_STATUS_MISCLDO_DONE_Msk  0x8000UL
#define SRSS_PWR_CBUCK_STATUS_SR_CUR_MODE_Pos   24UL
#define SRSS_PWR_CBUCK_STATUS_SR_CUR_MODE_Msk   0x7000000UL
#define SRSS_PWR_CBUCK_STATUS_PMU_DONE_Pos      31UL
#define SRSS_PWR_CBUCK_STATUS_PMU_DONE_Msk      0x80000000UL
