PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_srss_v1_1.h
/* SRSS.PWR_RETLDO_CTL */
#define SRSS_PWR_RETLDO_CTL_RETLDO_LVL_Pos      0UL
#define SRSS_PWR_RETLDO_CTL_RETLDO_LVL_Msk      0x1FUL
#define SRSS_PWR_RETLDO_CTL_RETLDO_GAIN_Pos     5UL
#define SRSS_PWR_RETLDO_CTL_RETLDO_GAIN_Msk     0x20UL
#define SRSS_PWR_RETLDO_CTL_RETLDO_LVL_DPSLP_Pos 8UL
#define SRSS_PWR_RETLDO_CTL_RETLDO_LVL_DPSLP_Msk 0x1F00UL
#define SRSS_PWR_RETLDO_CTL_RETLDO_GAIN_DPSLP_Pos 13UL
#define SRSS_PWR_RETLDO_CTL_RETLDO_GAIN_DPSLP_Msk 0x2000UL
/* SRSS.PWR_SRAMLDO_CTL */
#define SRSS_PWR_SRAMLDO_CTL_SRAMLDO_EN_Pos     0UL
#define SRSS_PWR_SRAMLDO_CTL_SRAMLDO_EN_Msk     0x1UL
#define SRSS_PWR_SRAMLDO_CTL_SRAMLDO_DPSLP_EN_Pos 1UL
#define SRSS_PWR_SRAMLDO_CTL_SRAMLDO_DPSLP_EN_Msk 0x2UL
#define SRSS_PWR_SRAMLDO_CTL_SRAMLDO_VOUT_Pos   2UL
#define SRSS_PWR_SRAMLDO_CTL_SRAMLDO_VOUT_Msk   0x7CUL
/* SRSS.PWR_MISCLDO_CTL */
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_EN_Pos     0UL
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_EN_Msk     0x1UL
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_MODE_Pos   1UL
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_MODE_Msk   0x2UL
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_VOUT_Pos   2UL
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_VOUT_Msk   0x7CUL
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_VCCACT_TRIM_Pos 7UL
#define SRSS_PWR_MISCLDO_CTL_MISCLDO_VCCACT_TRIM_Msk 0x780UL
/* SRSS.PWR_TRIM_PMU_CTL0 */
#define SRSS_PWR_TRIM_PMU_CTL0_LP_BUF_TRIM_Pos  0UL
#define SRSS_PWR_TRIM_PMU_CTL0_LP_BUF_TRIM_Msk  0x1FUL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_DIS_CHOP_Pos 5UL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_DIS_CHOP_Msk 0x20UL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_CHOP_DELAY_Pos 6UL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_CHOP_DELAY_Msk 0xC0UL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_TRIM_Pos    8UL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_TRIM_Msk    0xF00UL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_RCTAT_ADJ_Pos 12UL
#define SRSS_PWR_TRIM_PMU_CTL0_HPBG_RCTAT_ADJ_Msk 0xF000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC8M_FORCE_EN_Pos 16UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC8M_FORCE_EN_Msk 0x10000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC4M_FORCE_EN_Pos 17UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC4M_FORCE_EN_Msk 0x20000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC4M_FREQ_SEL_Pos 18UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC4M_FREQ_SEL_Msk 0x40000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_FREQ_SEL_Pos 19UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_FREQ_SEL_Msk 0x80000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_RESET_Pos 20UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_RESET_Msk 0x100000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_START_Pos 21UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_START_Msk 0x200000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_MANUAL_8M_Pos 22UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_MANUAL_8M_Msk 0x400000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_MANUAL_4M_Pos 23UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_MANUAL_4M_Msk 0x800000UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_CODE_8M_Pos 24UL
#define SRSS_PWR_TRIM_PMU_CTL0_OSC_CAL_CODE_8M_Msk 0x1F000000UL
/* SRSS.CLK_TRIM_ECO_CTL */
#define SRSS_CLK_TRIM_ECO_CTL_ECO_CTRL_IBOOSTEN_Pos 0UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_CTRL_IBOOSTEN_Msk 0x1UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_CTRL_CPBOOST_Pos 4UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_CTRL_CPBOOST_Msk 0x10UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_CTRL_WDBOOST_Pos 8UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_CTRL_WDBOOST_Msk 0x100UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_TRIM_FBK_Pos  16UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_TRIM_FBK_Msk  0x30000UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_TRIM_WDHYST_Pos 18UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_TRIM_WDHYST_Msk 0xC0000UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_TRIM_IREF_Pos 20UL
#define SRSS_CLK_TRIM_ECO_CTL_ECO_TRIM_IREF_Msk 0x1F00000UL
/* SRSS.WDT_CTL */
#define SRSS_WDT_CTL_WDT_EN_Pos                 0UL
#define SRSS_WDT_CTL_WDT_EN_Msk                 0x1UL
#define SRSS_WDT_CTL_WDT_CLK_SEL_Pos            4UL
#define SRSS_WDT_CTL_WDT_CLK_SEL_Msk            0x30UL
#define SRSS_WDT_CTL_WDT_LOCK_Pos               30UL
#define SRSS_WDT_CTL_WDT_LOCK_Msk               0xC0000000UL
/* SRSS.WDT_CNT */
#define SRSS_WDT_CNT_COUNTER_Pos                0UL
#define SRSS_WDT_CNT_COUNTER_Msk                0xFFFFFFFFUL
/* SRSS.WDT_MATCH */
#define SRSS_WDT_MATCH_MATCH_Pos                0UL
#define SRSS_WDT_MATCH_MATCH_Msk                0xFFFFFFFFUL
/* SRSS.WDT_MATCH2 */
#define SRSS_WDT_MATCH2_IGNORE_BITS_ABOVE_Pos   0UL
#define SRSS_WDT_MATCH2_IGNORE_BITS_ABOVE_Msk   0x1FUL


#endif /* _CYIP_SRSS_V1_1_H_ */


/* [] END OF FILE */
